# Parameter Type Id Mirror Copy Property

Source: https://www.revitapidocs.com/2026/e74bd5e1-6efd-687c-556b-87f81b81854d.htm

---

| Parameter Type Id Mirror Copy Property |
| --- |

"Copy"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MirrorCopy { get; }
```

```
Public Shared ReadOnly Property MirrorCopy As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MirrorCopy {
	ForgeTypeId^ get ();
}
```

```
static member MirrorCopy : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace